const cities = ['哈尔滨', '齐齐哈尔', '牡丹江', '佳木斯', '大庆', '鸡西', '绥化', '呼伦贝尔', '伊春', '鹤岗', '双鸭山', '七台河', '黑河', '大兴安岭'];

const districts = {
	"哈尔滨" : ["道里区", "南岗区", "道外区", "平房区", "松北区", "香坊区", "呼兰区", "阿城区", "双城区", "依兰县", "方正县", "宾县", "巴彦县", "木兰县", "通河县",
			"延寿县", "尚志市", "五常市"],
	"齐齐哈尔" : ["龙沙区", "建华区", "铁锋区", "昂昂溪区", "富拉尔基区", "碾子山区", "梅里斯达斡尔族区", "龙江县", "依安县", "泰来县", "甘南县", "富裕县", "克山县",
			"克东县", "拜泉县", "讷河市"],
	"牡丹江" : ["东安区", "阳明区", "爱民区", "西安区", "林口县", "东宁市", "绥芬河市", "海林市", "宁安市", "穆棱市"],
	"佳木斯" : ["向阳区", "前进区", "东风区", "郊区", "桦南县", "桦川县", "汤原县", "同江市", "富锦市", "抚远市"],
	"大庆" : ["萨尔图区", "龙凤区", "让胡路区", "红岗区", "大同区", "肇州县", "肇源县", "林甸县", "杜尔伯特蒙古族自治县"],
	"伊春" : ["伊春区", "南岔区", "友好区", "西林区", "翠峦区", "新青区", "美溪区", "金山屯区", "五营区", "乌马河区", "汤旺河区", "带岭区", "乌伊岭区", "红星区",
			"上甘岭区", "嘉荫县", "铁力市"],
	"鸡西" : ["鸡冠区", "恒山区", "滴道区", "梨树区", "城子河区", "麻山区", "鸡东县", "虎林市", "密山市"],
	"鹤岗" : ["向阳区", "工农区", "南山区", "兴安区", "东山区", "兴山区", "萝北县", "绥滨县"],
	"双鸭山" : ["尖山区", "岭东区", "四方台区", "宝山区", "集贤县", "友谊县", "宝清县", "饶河县"],
	"七台河" : ["新兴区", "桃山区", "茄子河区", "勃利县"],
	"绥化" : ["北林区", "望奎县", "兰西县", "青冈县", "庆安县", "明水县", "绥棱县", "安达市", "肇东市", "海伦市"],
	"呼伦贝尔" : ["海拉尔区", "扎赉诺尔区", "阿荣旗", "莫力达瓦达斡尔族自治旗", "鄂伦春自治旗", "鄂温克族自治旗", "陈巴尔虎旗", "新巴尔虎左旗", "新巴尔虎右旗", "满洲里市", "牙克石市",
			"扎兰屯市", "额尔古纳市", "根河市"],
	"黑河" : ["爱辉区", "嫩江县", "逊克县", "孙吴县", "北安市", "五大连池市"],
	"大兴安岭" : ["呼玛县", "塔河县", "漠河县", "加格达奇区", "松岭区", "新林区", "呼中区"]
};
let city = $(".heilongjiang-city");
let district = $(".district");
function ter(city) {
	for (var i = 0; i < districts[city].length; i++) {
		var value = districts[city][i];
		district.append("<option value='" + value + "'>" + value + "</option>");
	}
}
$(document).ready(function() {
	city.on("change", function() {

		district.empty();
		if ($(this).val() != "") {
			ter($(this).val());
		}

		console.log($(this).val())
	})
	if (city.prop("tagName") != "SELECT")
		throw "wrong tab";
	city.append("<option value=''>--请选择--</option>");
	for (var i = 0; i < cities.length; i++) {
		city.append("<option value='" + cities[i] + "'>" + cities[i] + "</option>");
	}
});
